Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Доступные для выбора узлы представлены в виде дерева.
en: The nodes available for selection are dispalyed in the form of a tree.

source: Дублировать единичные значения — если в составе последовательности имеется единичный элемент и вложенная последовательность, значения единичного элемента будут продублированы для каждой строки, образованной из вложенной последовательности.
en: Repeat single values: if there are a single item and nested sequence included into a sequence, the single item values will be repeated for each row formed from the nested sequence.

source: Дублировать единичные значения — при установке данного флага для каждого дочернего элемента XML ответа сервиса выводится информация, содержащаяся в родительском элементе (например, атрибуты, дочерние элементы с maxOccurs=1).
en: Repeat single values: when this checkbox is selected, the information in the parent element is displayed for each child XML element of the service response (for example, attributes, child elements with maxOccurs=1).

source: Дублировать значения родительских узлов – если в структуре имеется родительский узел и последовательность потомков, значение родительского узла будет продублировано для каждой строки, образованной из последовательности потомков.
en: Repeat parent node values: if there are a parent node and a sequence of descendants in the structure, the parent node value will be repeated for each string generated from a sequence of descendants.

source: Еще порт Добавление еще одного порта — создает новые порты входа для последующих наборов переменных.
en: Another port Add another port enables to create new input ports for the subsequent sets of variables.

source: Завершить программу по тайм-ауту — переключатель позволяет включать/отключать тайм-аут выполнения узла.
en: Terminate program by timeout: the switch enables/disables the node execution timeout.

source: Зависимая переменная
en: Dependent variable

source: Заголовок в первой строке — флаг, определяющий, что метки полей создаваемого набора данных содержатся в первой строке импортируемого текста;
en: First line title: the checkbox that enables to determine that captions of the fields of the created data set are present in the first line of the imported text.

source: Заголовок — наименование диаграммы.
en: Header: chart name.

source: Заданное количество раз — аналог "FOR ...
en: Set number of times is analogue of "FOR ...

source: Заданные итерации — данный вид цикла будет выполняться столько раз, сколько будет задано в параметре "Количество итераций".
en: Given iterations: this loop type will be executed as many times as it will be set in the "Iteration count" parameter.

source: Задать число факторов — количество значимых факторов выбирается аналитиком самостоятельно.
en: Set the factor number: the number of the significant factors is selected by an analyst independently.

source: Задержка (мс) — время, за которое происходит обновление данных (время анимации).
en: Delay (ms): the time required to update data (animation time).

source: Закрепление/открепление колонки — закрепить/открепить колонку, для этого необходимо в заголовочном меню колонки по клику на кнопку Раскрыть выбрать пункт меню Снять закрепление столбца Снять закрепление столбца или Закрепить столбец Закрепить столбец.
en: Freeze/unfreeze column: freeze/unfreeze the column. For this purpose, it is required to click on Open button in the column caption menu, select Unfreeze column Unfreeze column or Freeze column Freeze column menu option.

source: Закрыть пакет — закрытие открытого Пакета.
en: Close package enables to close an opened Package.

source: Замена (переменные)
en: Replace (variables)

source: Замена (переменные) — заменяет значения выбранных переменных на значения из таблицы замен;
en: Replace (variables) enables to replace the values of the selected variables to the values from the replacement table.

source: Замена-переменные Замена (переменные)
en: Replace (Variables) Replace (Variables)

source: Замена
en: Replace

source: Замена Замена — поле содержит новые значения;
en: Replace Replace: the field contains new values.

source: Замена Замена
en: Replace Replace

source: Заменять остальное
en: Replace the rest

source: Заменять остальные — содержит варианты замены значений, не найденных при помощи таблицы замен.
en: Replace other contains replacement options of the values that have not been found using the replacement table.

source: Заменять остальные — содержит варианты замены значений, не найденных при помощи таблицы замен:
en: Replace other contains replacement options of the values that have not been found using the replacement table:

source: Заморозить выбранные — изменить статус поля на Заморожено (т.е. поле не будет использоваться при переобучении), команда также доступна при нажатии на кнопку Заморожено слева от каждого входного столбца;
en: Lock selected: enables to change the field status to Locked (thus, the field will not be used during retraining). The command is also available by pressing Locked button to the left of each input column.

source: Записывать Byte Order Mark — записывать маркер последовательности байтов.
en: Write Byte Order Mark enables to write marker of bytes sequence.

source: Зашифрованная БД — флаг устанавливает режим шифрования БД.
en: Encrypted DB: the checkbox enables to set the DB encryption mode.

source: Значение кодировки — задает кодировку символов, в которой будут трактоваться данные с сервера.
en: Encoding value provides encoding of characters according to which the server data will be interpreted.

source: Значение кодировки — позволяет задать язык сообщений сервера БД и кодовую страницу для значений символьных типов, представленных не в UNICODE: char, varchar, text.
en: Encoding value enables to set the message language of the DB server and codepage for the values related to the character types represented not in UNICODE: char, varchar, text.

source: Значение сезонного индекса — коэффициент, характеризующий сезонность для данной точки и данной позиции.
en: Seasonal index value: the index describing seasonality of this point and this position.

source: Значение тренда — значение тренда в данной точке для данной позиции.
en: Trend value: the trend value in this point for this position.

source: Значение (Имя измерения.Value) — значение измерения.
en: Value (Dimension name.Value): dimension value.

source: Значение Значение — поле содержит заменяемые значения;
en: Value Value: the field contains replaced values.

source: Значение Значение — факты будут отображаться в виде абсолютных значений;
en: Value Value: the measures will be displayed in the form of absolute values.

source: Значение — выводит используемое значение Порога отсечения.
en: Value shows the used Cutoff value.

source: Значение — для Фактов отображает выбранные агрегации, для остальных элементов отображается значение фильтрации, если указано условие;
en: Value for Fact displays the selected aggregations, the filtration value is displayed for other items if a condition is specified.

source: Значение — значение переменных выходного набора порта (о назначении полей см.
en: Value: value of the variables of the output data set of the port (more detailed information of the fields usage type is provided in

source: Значение — поле для ввода значения, с которым будет сравниваться переменная.
en: Value: the field for entering of the value with which the variable will be compared.

source: Значение — формируется из всех значений поля, агрегированных выбранной функцией.
en: Value is generated from all field values aggregated by the selected function.

source: Значения Значения;
en: Values Values;

source: Значения — этот столбец содержит все значения транспонируемых столбцов, т.к. эти столбцы могут иметь разный тип (как это показано в примере), то столбец Значения имеет тип данных Переменный Переменный.
en: Values: this column contains all values of the transposed columns because these columns can be of different type (as in the example), so, the Values column can have Variable Variable type of data.

source: Значимость поля — мера влияния поля на попадание поля в некоторый кластер.
en: Field importance: measure of the field influence on inclusion of the field into any cluster.

source: Значимость цветом Значимость цветом — показать/скрыть значимость как тепловую карту.
en: Importance by color Importance by color: show/hide importance as the heat map.

source: Значимость ячейки — мера влияния ячейки на попадание ячейки в некоторый кластер.
en: Cell importance: measure of the cell influence on inclusion of the cell into any cluster.

source: Значимость
en: Significance

source: Значимость Значимость;
en: Importance Importance;

source: Значимость — условный вывод о наличии/отсутствии корреляции на данном лаге.
en: Significance: conditional conclusion concerning availability/unavailability of correlation in the given lag.

source: И/ИЛИ — кнопка-переключатель появляется между двумя условиями в ветви:
en: AND/OR: switch button appears between two conditions in the branch.

source: И — связываемые условия дадут значение "истина", если они оба истинны.
en: AND: the connected conditions will have the "true" value if both of them are true.

source: ИЛИ — связываемые условия дадут значение "истина", если истинно хотя бы одно из них.
en: OR: the connected conditions will have the "true" value if at least one condition is true.

source: Игнорировать ошибки SSL сертификата — если данный флаг установлен, то ошибки при проверке сертификата сервера, к которому производится подключение, игнорируются.
en: Ignore SSL certificate errors: if this checkbox is selected, the errors detected while testing the server certificate to be connected with are ignored.

source: Игнорировать ошибки SSL сертификата — при подключении по SSL сертификат сервера может не пройти проверку по каким-то причинам.
en: Ignore SSL certificate errors: when SSL connecting, the server certificate can fail the test due to some reasons.

source: Игнорировать ошибки — флаг отключает прерывание выполнения цикла при обнаружении ошибок.
en: Ignore errors: the checkbox disables interruption of the loop execution in the case of errors detection.

source: Идентификатор запроса — поле входного набора — каждый запрос формируется из нескольких строк входной таблицы с совпадающим идентификатором.
en: Request identifier - input data set field: each request is generated from several input table rows with matching identifier.

source: Идентификация XML-документа — в этой области определяется наличие столбца идентификаторов в извлекаемой таблице и в таблице логов:
en: XML Document Identification: availability of the identifier column in the extracted table and log table is defined in this area:

source: Идентификация XML-документа — выбор одного из вариантов наполнения XML данными входной таблицы:
en: XML Document Identification: selection of one of the options used to fill XML with the input table data:

source: Изменить тип замены — задает тип данных столбца с новыми значениями;
en: Change replacement type enables to set data type of the column with new values.

source: Изменить тип замены — позволяет изменить тип данных переменной после произведенной замены.
en: Change replacement type enables to change data type of the variable after performed replacement.

source: Измерение Измерение.
en: Dimension Dimension.

source: Измерения — это категориальные, дискретные атрибуты, наименования и свойства объектов, участвующих в некотором бизнес-процессе.
en: Dimensions mean the categorical, discrete attributes, names and properties of the objects involved into some business process.

source: Иллюстрация работы алгоритма k-means
en: Figure Describing k-means Algorithm Operation

source: Имена — столбец с именами транспонируемых столбцов.
en: Names: the column with the names of the transposed columns.

source: Именованный диапазон — по наименованию созданного в книге именованного диапазона.
en: Named range: by the name of the named range created in the workbook.

source: Имитировать запрос с ответом в файле — при установке флага фактического запроса к сервису не происходит, а в качестве ответа сервиса выводится содержимое указанного файла.
en: Simulate request with response in a file: when this checkbox is selected, no actual request is sent to the service, and the content of the specified file is displayed as the service response.

source: Имитировать запрос с ответом в файле — при установке флага фактического запроса к сервису не происходит, а обработчик в качестве ответа сервиса подставляет содержимое указанного файла.
en: Simulate request with response in a file: when this checkbox is selected, no actual request is sent to the service, and the handler substitutes content of the specified file as the service response.

source: Импорт XML
en: XML Import;

source: Импорт данных
en: Data import

source: Импорт из ХД Импорт из Deductor Warehouse
en: Import from the DW Import from Deductor Warehouse

source: Импорт Импорт – считывает таблицу замен из указанного текстового файла заданного формата.
en: Import Import enables to read the replacement table from the specified text file of the set format.

source: Импорт Импорт — импорт таблицы замен из текстового файла определенной структуры;
en: Import Import provides import of the replacement table from the text file with a particular structure.

source: Импорт — раздел предназначен для описания узлов извлечения данных из внешних источников с целью их последующей обработки;
en: Import. The section is designated for description of the nodes used for data retrieval from the external sources for their further processing.

source: Импортировать — пустые строки будут импортированы.
en: Import: blank rows will be imported.

source: Имя базы — системное наименование базы данных, может состоять только из символов английской раскладки клавиатуры.
en: Base name: the system database name can consist of the English keyboard layout characters only.

source: Имя листа для экспорта — то, как будет называться лист в файле Excel, содержащий экспортируемую таблицу.
en: Sheet name: the name of the sheet in the Excel file that contains the exported table.

source: Имя пользователя и пароль — выбирается если SOAP-сервис для работы требует авторизацию по имени/паролю.
en: Username and password: this option is selected if authorization by name/password is required by SOAP service for work.

source: Имя пользователя и пароль — выбирается, если требуется авторизация по имени/паролю.
en: Username and password: this option is selected when authorization by name/password is required.

source: Имя пользователя, Пароль — поле становится активным, если выбран тип Имя пользователя и пароль.
en: Username, Password: the field becomes active if Username and password type is selected.

source: Имя пользователя — имя пользователя БД.
en: Username: name of the DB user.

source: Имя пользователя — поле становится активным если выбран тип Имя пользователя и пароль.
en: Username: the field becomes active if Username and password type is selected.

source: Имя таблицы — задает имя таблицы, в которую планируется осуществить экспорт.
en: Table name enables to set a name of the table to which it is planned to export data.

source: Имя указывается явно — пользователь самостоятельно задает уникальное имя порта.
en: Explicitly given name: a user sets the unique port name by himself.

source: Имя файла — задает путь к импортируемому файлу при локальном подключении, либо имя файла при использовании подключения к папке.
en: File name enables to set a path to the imported file when the connection is local, or a file name when using connection to a folder.

source: Имя файла — задает путь к файлу-приемнику при локальном подключении, либо имя файла при использовании подключения к папке.
en: File name enables to set a path to the destination file when the connection is local, or a file name when using connection to a folder.

source: Имя файла — путь к файлу, содержащему необходимые данные;
en: File name: the path to the file that contains required data.

source: Имя — будет совпадать с именем поля, если была выбрана лишь одна функция.
en: Name will coincide with the field name if only one function is selected.

source: Имя — в этом поле задается имя новой общей папки, в окне редактирования это поле не доступно.
en: Name: the name of the new shared folder is set in this field. This field is not available in the editing window.

source: Имя — вводится имя поля присваемое столбцу в выходном наборе данных;
en: Name: it is required to enter the field name assigned to the column in the output data set.

source: Имя — задается уникальное имя поля.
en: Name: the unique field name is assigned.

source: Имя — идентификатор, который можно использовать в формулах других вычисляемых фактов;
en: Name: the identifier that can be used in formulas of other calculated measures.

source: Имя — имена полей/переменных выходного набора порта.
en: Name: names of the fields/variables of the output data set of the port.

source: Имя — имя Пакета.
en: Name: name of the Package.

source: Имя — имя переменной в выходном наборе данных;
en: Name: the variable name in the output data set.

source: Имя — указывается имя Пакета.
en: Name — the Package name is specified.

source: Имя — уникальное наименование столбца в рамках одного набора данных.
en: Name: the unique column name for one data set.

source: Имя — файл Пакета;
en: Name: Package file.

source: Иначе — активирует выполнение только ветви Иначе.
en: Otherwise enables to activate execution of only Otherwise branch.

source: Инвертировать выбор Инвертировать выбор — меняет отмеченные и не отмеченные элементы местами;
en: Invert selection Invert selection enables to invert selected and not selected items.

source: Индекс качества разгруппировки — принимает значения от 0 (очень плохое качество, результатам нельзя доверять) до 1 ("идеальное" качество, опорная выборка не содержит шума, а разгруппированные значения точно укладываются в прогноз).
en: Ungrouping quality indicator takes the values from 0 (very poor quality, it is not recommended to rely on the results) to 1 (the "ideal" quality, the reference sample does not contain noise, and ungrouped values fully conform to the forecast).

source: Индекс уникального значения — каждое уникальное значение заменяется на индекс уникального значения.
en: Unique value index: each unique value is replaced with the unique value index.

source: Индикатор (без опорной категории) — длина закодированной строки равна n.
en: Indicator (without reference category): the encoded string length is equal to n.

source: Индикатор — длина закодированной строки равна n-1, где n — количество уникальных значений.
en: Indicator: the encoded string length is equal to n-1 where n is a count of unique values.

source: Индикатор — переключить варианты отображения Индикаторов.
en: Indicator: switch the display options of Indicators.

source: Инспектор свойств
en: Property inspector

source: Инспектор свойств предназначен для получения информации о свойствах узла сценария.
en: Property inspector is intended for receipt of information on the workflow node properties.

source: Интеграция с базами данных
en: Integration with databases

source: Интеграция
en: Integration

source: Интерактивное выполнение сценария.
en: Interactive workflow execution.

source: Интерактивный режим работы
en: Interactive mode of operation

source: Интерактивный режим работы — режим, при котором проектирование, запуск узлов и отладка сценариев осуществляется в интерфейсе Loginom Studio.
en: Interactive mode of operation means the mode when design, start of nodes and debugging of workflows are performed in the interface of Loginom Studio.

source: Интервалов — количество интервалов, на которые будут разбиты значения поля.
en: Bins: count of bins to which the field values will be binned.

source: Интерфейс «Связи»
en: "Connections" interface

source: Интерфейс «Таблица»
en: "Table" interface

source: Интерфейс
en: Interface

source: Инф.
en: Inf.

source: Информации о модели;
en: Model Info;

source: Информационное Информационное — поле содержит дополнительный вариант нового значения.
en: Info Info: the field contains an additional option of the new value.

source: Информационные Информационные — содержит поля, которые не будут изменяться.
en: Info Info: contains the fields that will not be changed.

source: Информационный критерий Акаике скорректированный
en: Akaike information criterion corrected

source: Информационный критерий Акаике
en: Akaike information criterion

source: Информационный критерий Байеса
en: Bayesian information criterion

source: Информационный критерий Ханнана-Квина
en: Hannan-Quinn information criterion

source: Информация в русском разделе википедии
en: Information in the Russian section in Wikipedia;

source: Информация в русском разделе википедии;
en: Information in the Russian section in Wikipedia;

source: Информация по Firebird в русском разделе википедии;
en: Information on Firebird in the Russian section in Wikipedia;

source: Информация по Microsoft SQL Server в русском разделе википедии;
en: Information on Microsoft SQL Server in the Russian section in Wikipedia;

source: Информация по Oracle Database в русском разделе википедии;
en: Information on Oracle Database in the Russian section in Wikipedia;

source: Информация по PRAGMA.
en: PRAGMA Information.

source: Исключать одиночные наборы — исключает наборы из одного элемента;
en: Exclude single sets enables to exclude the sets from one item.

source: Исключать элементы с поддержкой, больше максимальной — элементы, которые слишком часто встречаются в транзакциях, как правило, не несут информации о закономерностях сочетания с ними других элементов.
en: Exclude the items with the support exceeding the maximum one: the items that occur too frequently in transactions and, as a rule, do not contain information on principles of combination with other items.

source: Исключить — пустые строки не будут импортированы.
en: Exclude: blank rows will not be imported.

source: Использование переменных
en: Variables use

source: Использование служебных портов для задания последовательности выполнения узлов.
en: Use of the service ports to set the nodes execution order.

source: Использование узла подключения.
en: Connection Node Use.

source: Использовать SSL — при установленном флаге данные передаются по критографическому протоколу SSL/TLS.
en: Use SSL: when this checkbox is selected, the data is transferred via the cryptographic SSL/TLS protocol.

source: Использовать детальные настройки — позволяет более развернуто настроить линейную регрессию (появляется дополнительная страница мастера — блок детальных настроек).
en: Use detailed settings provides more detailed configuration of linear regression (additional wizard page appears - pack of detailed settings).

source: Использовать детальные настройки — позволяет более развернуто настроить логистическую регрессию (появляется дополнительная страница мастера — блок детальных настроек).
en: Use detailed settings provides more detailed configuration of logistic regression (additional wizard page appears - pack of detailed settings).

source: Использовать подмножество обучающего набора — использование подвыборки обучающего множества для автоподбора;
en: Use a subset of the training set enables to use a subsample of the training set for autofit.

source: Использовать префиксы — включение данного флага позволяет добавить в результирующей таблице префиксы к именам и меткам полей, взятых из присоединяемых таблиц.
en: Use prefixes: selection of this checkbox enables to add prefixes to names and captions of the fields from the joined tables in the resulting table.
